Revit 2027 API
View.SetDepthCueing Method
 Sets the depth cueing settings for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDepthCueing(
	ViewDisplayDepthCueing depthCueing
)
Public Sub SetDepthCueing (
	depthCueing As ViewDisplayDepthCueing
)
public:
void SetDepthCueing(
	ViewDisplayDepthCueing^ depthCueing
)
member SetDepthCueing :
        depthCueing : ViewDisplayDepthCueing -> unit
Parameters
depthCueing ViewDisplayDepthCueing
 Depth cueing settings to set.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This view does not contain display-related properties. -or- This view cannot use Depth Cueing
See Also
Reference
View Class
Autodesk.Revit.DB Namespace